app/controllers/posts_controller.rb

	def create
		@post = Post.new(article_params)

		if @post.save
---
INSERT INTO "posts" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hello"], ["text", "this is a test"], ["created_at", "2015-08-20 15:45:27.994512"], ["updated_at", "2015-08-20 15:45:27.994512"]]

	def update
		@post = Post.find(params[:id])

		if @post.update(article_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 20]]
UPDATE "posts" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "112512531532"], ["text", "5235235235"], ["updated_at", "2015-08-20 18:39:15.486974"], ["id", 2]]